nxp-mcuxpresso/mcux-sdk-examples/frdmke17z512/demo_apps/bubble_peripheral/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD17 (number 20), J1[1]/LPUART2_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LPUART2_RX_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_LPUART2_RX_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_LPUART2_RX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE12 (number 19), J1[7]/LPUART2_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LPUART2_TX_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_LPUART2_TX_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_LPUART2_TX_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTD10 (number 36), D6[1]/RGB_RED/FTM2_CH0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD5 (number 33), D6[4]/RGB_GREEN/FTM2_CH3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_GREEN_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_GREEN_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LED_GREEN_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB8 (number 77), U11[2]/LPI2C0_SCL-FXLS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FXLS_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_FXLS_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_FXLS_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA16 (number 82), U11[3]/LPI2C0_SDA-FXLS
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FXLS_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_FXLS_SDA_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_FXLS_SDA_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

/*! @name PORTB8 (number 77), U11[2]/LPI2C0_SCL-FXLS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORTA16 (number 82), U11[3]/LPI2C0_SDA-FXLS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INIT_I2C_GPIO_PINS_FXLS_SDA_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_I2C_GPIO_pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
